Kubernetes/cloudlab/results/k8s-sn-wrk-user.txt
No argument supplied
using default
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 2.272ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.290ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.308ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.304ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.25ms  419.11us   3.54ms   70.17%
    Req/Sec    52.55     74.00   300.00     91.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25ms
 75.000%    2.51ms
 90.000%    2.73ms
 99.000%    3.54ms
 99.900%    4.11ms
 99.990%    4.77ms
 99.999%    4.77ms
100.000%    4.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.060     0.000000            1         1.00
       1.727     0.100000          400         1.11
       1.883     0.200000          799         1.25
       2.015     0.300000         1199         1.43
       2.129     0.400000         1601         1.67
       2.253     0.500000         1998         2.00
       2.297     0.550000         2196         2.22
       2.351     0.600000         2396         2.50
       2.403     0.650000         2601         2.86
       2.457     0.700000         2800         3.33
       2.505     0.750000         2993         4.00
       2.533     0.775000         3094         4.44
       2.563     0.800000         3194         5.00
       2.601     0.825000         3291         5.71
       2.639     0.850000         3393         6.67
       2.687     0.875000         3497         8.00
       2.711     0.887500         3541         8.89
       2.735     0.900000         3591        10.00
       2.761     0.912500         3643        11.43
       2.783     0.925000         3690        13.33
       2.825     0.937500         3740        16.00
       2.849     0.943750         3766        17.78
       2.875     0.950000         3790        20.00
       2.905     0.956250         3819        22.86
       2.935     0.962500         3841        26.67
       3.007     0.968750         3865        32.00
       3.043     0.971875         3877        35.56
       3.097     0.975000         3890        40.00
       3.185     0.978125         3902        45.71
       3.273     0.981250         3915        53.33
       3.373     0.984375         3927        64.00
       3.403     0.985938         3934        71.11
       3.479     0.987500         3940        80.00
       3.529     0.989062         3946        91.43
       3.577     0.990625         3952       106.67
       3.645     0.992188         3958       128.00
       3.679     0.992969         3961       142.22
       3.761     0.993750         3965       160.00
       3.779     0.994531         3968       182.86
       3.841     0.995313         3971       213.33
       3.885     0.996094         3974       256.00
       3.903     0.996484         3975       284.44
       3.935     0.996875         3977       320.00
       3.993     0.997266         3979       365.71
       4.001     0.997656         3980       426.67
       4.063     0.998047         3982       512.00
       4.063     0.998242         3982       568.89
       4.087     0.998437         3983       640.00
       4.103     0.998633         3984       731.43
       4.111     0.998828         3985       853.33
       4.179     0.999023         3986      1024.00
       4.179     0.999121         3986      1137.78
       4.179     0.999219         3986      1280.00
       4.407     0.999316         3987      1462.86
       4.407     0.999414         3987      1706.67
       4.767     0.999512         3988      2048.00
       4.767     0.999561         3988      2275.56
       4.767     0.999609         3988      2560.00
       4.767     0.999658         3988      2925.71
       4.767     0.999707         3988      3413.33
       4.771     0.999756         3989      4096.00
       4.771     1.000000         3989          inf
#[Mean    =        2.248, StdDeviation   =        0.419]
#[Max     =        4.768, Total count    =         3989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5993 requests in 30.01s, 1.14MB read
Requests/sec:    199.73
Transfer/sec:     38.81KB